Revit 2026 API

# CircleLightShape(CircleLightShape) Constructor

---

Creates a copy of the given circle light shape

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CircleLightShape(
	CircleLightShape other
)
```
```vb
Public Sub New (
	other As CircleLightShape
)
```
```cpp
public:
CircleLightShape(
	CircleLightShape^ other
)
```
```fsharp
new :
        other : CircleLightShape -> CircleLightShape
```

#### Parameters

other CircleLightShape

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

CircleLightShape Class

CircleLightShape Overload

Autodesk.Revit.DB.Lighting Namespace